Repository: HNorlen/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/embeddedc/embeddedc_samples.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Embedded C Client Library - Samples
de: Embedded C-Clientbibliothek - Beispiele
es: Biblioteca de cliente Embedded C - Ejemplos
fr: Bibliothèque client Embedded C - Exemples
it: Libreria client C integrato – Esempi
ja: Embedded C クライアント・ライブラリー - サンプル
ko: Embedded C 클라이언트 라이브러리 - 샘플
pt_br: Biblioteca do Cliente C Integrada - Amostras
zh_cn: 嵌入式 C 客户机库 - 样本
zh_tw: Embedded C 用戶端程式庫 - 範例

source: Prerequisites
de: Voraussetzungen
es: Requisitos previos
fr: Conditions préalables
it: Prerequisiti
ja: 前提条件
ko: 전제조건
pt_br: Pré-requisitos
zh_cn: 先决条件
zh_tw: 必要條件

source: You must complete the Installation steps in the Internet of Things Foundation Embedded C Samples - Introduction page, before you can run the following samples.
de: Sie müssen die folgenden Installationsschritte in 'Embedded C-Beispiele in Internet of Things Foundation - Einführung' ausführen, bevor Sie die folgenden Beispiele ausführen können.
es: Debe completar los pasos de Instalación en la página de Ejemplos de Embedded C de Internet of Things Foundation - Introducción, antes de poder ejecutar los ejemplos siguientes.
fr: Vous devez suivre les étapes d'installation indiquées dans la page d'introduction des exemples Embedded C d'Internet of Things Foundation pour pouvoir exécuter les exemples ci-dessous.
it: È necessario completare la procedura di installazione nella pagina introduttiva degli esempi di librerie client C integrato, prima di poter eseguire i seguenti esempi.
ja: 以下のサンプルを実行するには、その前に、「Internet of Things Foundation Embedded C サンプル - 概要」ページのインストール手順を完了しておく必要があります。
ko: 다음의 샘플을 실행하려면 먼저 Internet of Things Foundation Embedded C 샘플 - 소개 페이지에 있는 설치 단계를 완료해야 합니다.
pt_br: É necessário concluir as etapas de Instalação nas Amostras C Integradas do Internet of Things Foundation - Página de introdução, antes de poder executar as amostras a seguir.
zh_cn: 必须完成“Internet of Things Foundation 嵌入式 C 样本 - 简介”页面中的安装步骤，才可运行以下样本。
zh_tw: 在執行下列範例之前，您必須先完成「Internet of Things Foundation Embedded C 範例 - 簡介」頁面中的「安裝」步驟。

source: Using these samples
de: Diese Beispiele verwenden
es: Utilización de estos ejemplos
fr: Utilisation de ces exemples
it: Utilizzo degli esempi
ja: 次のサンプルを使用します。
ko: 이 샘플 사용
pt_br: Usando essas amostras
zh_cn: 使用这些样本
zh_tw: 使用這些範例

source: Using the cd command in the command prompt, navigate to the samples directory of your installation of the Embedded C client library.
de: Wechseln Sie mit dem Befehl cd in der Eingabeaufforderung zum Beispielverzeichnis der Installation der Embedded C-Clientbibliothek.
es: Utilizando el mandato cd en el indicador de mandatos, vaya al directorio de ejemplos de la instalación de la biblioteca de cliente Embedded C.
fr: Utilisez la commande cd à partir de l'invite de commande pour accéder au répertoire samples de l'installation de la bibliothèque client Embedded C.
it: Utilizzando il comando cd nella richiesta comandi, passare alla directory samples di installazione della libreria client C integrato.
ja: コマンド・プロンプトで cd コマンドを使用して、Embedded C クライアント・ライブラリーのインストール済み環境のサンプル・ディレクトリーにナビゲートします。
ko: 명령 프롬프트에서 cd 명령을 사용하여 Embedded C 클라이언트 라이브러리 설치의 samples 디렉토리를 탐색하십시오.
pt_br: Usando o comando cd no prompt de comandos, navegue para o diretório samples de sua instalação da Biblioteca do cliente C integrada.
zh_cn: 在命令提示符中使用 cd 命令，浏览到嵌入式 C 客户机库的安装位置的 samples 目录。
zh_tw: 使用命令提示字元中的 cd 指令，導覽至 Embedded C 用戶端程式庫安裝的 samples 目錄。

source: Go to the *samples* directory to run the sample. Either run *make* or use *build.sh* to compile and build the samples.
de: Gehen Sie zum Verzeichnis *samples*, und führen Sie das Beispiel aus. Führen Sie entweder *make* aus, oder verwenden Sie *build.sh* zum Kompilieren und Builden der Beispiele.
es: Vaya al directorio *samples* para ejecutar el ejemplo. Ejecute *make* o utilice *build.sh* para compilar y crear los ejemplos.
fr: Accédez au répertoire *samples* pour exécuter l'exemple. Exécutez *make* ou utilisez *build.sh* pour compiler et générer les exemples.
it: Andare alla directory *samples* per eseguire l'esempio. Eseguire *make* o utilizzare *build.sh* per compilare e creare gli esempi.
ja: *samples* ディレクトリーに移動してサンプルを実行します。*make* を実行するか *build.sh* を使用して、サンプルをコンパイルおよびビルドします。
ko: *samples* 디렉토리로 이동하여 샘플을 실행하십시오. *make*를 실행하거나 *build.sh*를 사용하여 샘플을 컴파일하고 빌드하십시오.
pt_br: Vá para o diretório *samples* para executar a amostra. Execute *make* ou use *build.sh* para compilar e construir as amostras.
zh_cn: 转至 *samples* 目录以运行样本。运行 *make* 或使用 *build.sh* 以编译和构建样本。
zh_tw: 跳至 *samples* 目錄以執行範例。執行 *make* 或使用 *build.sh* 來編譯及建置範例。

source: The helloWorld.c Sample Application
de: Die Beispielanwendung helloWorld.c
es: Aplicación de ejemplo helloWorld.c
fr: Exemple d'application helloWorld.c
it: L'applicazione di esempio helloWorld.c
ja: helloWorld.c サンプル・アプリケーション
ko: helloWorld.c 샘플 애플리케이션
pt_br: O Aplicativo de Amostra helloWorld.c
zh_cn: helloWorld.c 样本应用程序
zh_tw: helloWorld.c 範例應用程式

source: This sample application demonstrates the Internet of Things Foundation Quickstart service. The sample application connects to the Quickstart service and sends event data. To connect to the Quickstart service, you must provide an unique identifier for the device.
de: Diese Beispielanwendung veranschaulicht den Quickstart-Service von Internet of Things Foundation. Die Beispielanwendung stellt die Verbindung zum Quickstart-Service her und sendet Ereignisdaten. Zum Verbinden mit dem Quickstart-Service müssen Sie eine eindeutige ID für die Einheit angeben.
es: Esta aplicación de ejemplo muestra el servicio Quickstart de Internet of Things Foundation. La aplicación de ejemplo se conecta al servicio Quickstart y envía datos de suceso. Para conectarse al servicio Quickstart, debe proporcionar un identificador exclusivo para el dispositivo.
fr: Cet exemple d'application présente le service Quickstart d'Internet of Things Foundation. Il se connecte au service Quickstart et envoie des données d'événement. Pour vous connecter au service Quickstart, vous devez indiquer un identificateur unique du terminal.
it: Questa applicazione di esempio illustra il servizio Quickstart di Internet of Things Foundation. L'applicazione di esempio si connette al servizio Quickstart e invia i dati dell'evento. Per connettersi al servizio Quickstart, è necessario fornire un identificativo univoco per il dispositivo.
ja: このサンプル・アプリケーションは、Internet of Things Foundation Quickstart サービスをデモンストレーションします。サンプル・アプリケーションは Quickstart サービスに接続してイベント・データを送信します。Quickstart サービスに接続するには、デバイスの固有 ID を入力する必要があります。
ko: 이 샘플 애플리케이션은 Internet of Things Foundation Quickstart 서비스를 보여줍니다. 이 샘플 애플리케이션은 Quickstart 서비스에 연결하고 이벤트 데이터를 전송합니다. Quickstart 서비스에 연결하려면 디바이스에 대한 고유 ID를 제공해야 합니다.
pt_br: Esse aplicativo de amostra demonstra o serviço Quickstart do Internet of Things Foundation. O aplicativo de amostra conecta-se ao serviço Quickstart e envia dados do evento. Para conectar ao serviço Quickstart, deve-se fornecer um identificador exclusivo para o dispositivo.
zh_cn: 此样本应用程序演示 Internet of Things Foundation Quickstart 服务。样本应用程序连接到 Quickstart 服务并发送事件数据。要连接到 Quickstart 服务，必须提供设备的唯一标识。
zh_tw: 此範例應用程式示範 Internet of Things Foundation Quickstart 服務。此範例應用程式可連接到 Quickstart 服務及傳送事件資料。若要連接到 Quickstart 服務，您必須提供裝置的唯一 ID。

source: This sample is a great place to get started with the Internet of Things Foundation Service using Quickstart.
de: Dieses Beispiel eignet sich hervorragend für einen Einstieg in den Internet of Things Foundation-Service mit Quickstart.
es: Este ejemplo es un lugar perfecto para empezar a utilizar el servicio de Internet of Things Foundation utilizando Quickstart.
fr: Cet exemple est un outil efficace pour vous initier au service Internet of Things Foundation à l'aide de Quickstart.
it: Questo esempio è un ottimo posto per iniziare ad utilizzare il servizio Internet of Things Foundation tramite Quickstart.
ja: このサンプルは、Quickstart を使用する Internet of Things Foundation Service の入門として最適です。
ko: 이 샘플은 Quickstart를 사용하여 Internet of Things Foundation 서비스를 시작하는 최적의 위치입니다.
pt_br: Essa amostra é um ótimo lugar para começar com o Serviço do Internet of Things Foundation usando o Quickstart.
zh_cn: 此样本非常适合通过 Quickstart 开始使用 Internet of Things Foundation 服务。
zh_tw: 此範例是利用 Quickstart 來開始使用「Internet of Things Foundation 服務」的好地方。

source: The sampleDevice.c Sample Application
de: Die Beispielanwendung sampleDevice.c
es: Aplicación de ejemplo sampleDevice.c
fr: Exemple d'application sampleDevice.c
it: L'applicazione di esempio sampleDevice.c
ja: sampleDevice.c サンプル・アプリケーション
ko: sampleDevice.c 샘플 애플리케이션
pt_br: O Aplicativo de Amostra sampleDevice.c
zh_cn: sampleDevice.c 样本应用程序
zh_tw: sampleDevice.c 範例應用程式

source: This sample application demonstrates the registered mode in Internet of Things Foundation. This sample connects to the Internet of Things Foundation registered service. On registered mode, the devices can both publish events and receive commands.
de: Diese Beispielanwendung veranschaulicht den registrierten Modus in Internet of Things Foundation. Diese Beispielanwendung stellt die Verbindung zum registrierten Service von Internet of Things her. Im registrierten Modus können Einheiten sowohl Ereignisse publizieren als auch Befehle empfangen.
es: Esta aplicación de ejemplo muestra la modalidad registrada en Internet of Things Foundation. Este ejemplo se conecta al servicio registrado de Internet of Things Foundation. En modalidad registrada, los dispositivos pueden publicar sucesos y recibir mandatos.
fr: Cet exemple d'application présente le mode Enregistré d'Internet of Things Foundation. Il se connecte au service enregistré Internet of Things Foundation. En mode Enregistré, les terminaux peuvent publier et recevoir des commandes.
it: Questa applicazione di esempio illustra la modalità registrata in Internet of Things Foundation. Questo esempio connette al servizio registrato Internet of Things Foundation. In modalità registrata, i dispositivi possono sia pubblicare eventi che ricevere i comandi.
ja: このサンプル・アプリケーションは、Internet of Things Foundation の登録済みモードをデモンストレーションします。このサンプルは、Internet of Things Foundation の登録済みサービスに接続します。登録済みモードのデバイスは、イベントのパブリッシュとコマンドの受信をいずれも行えます。
ko: 이 샘플 애플리케이션은 Internet of Things Foundation에서 등록된 모드를 보여줍니다. 이 샘플은 Internet of Things Foundation 등록된 서비스에 연결됩니다. 등록된 모드에서 디바이스는 이벤트를 공개하고 명령을 수신할 수 있습니다.
pt_br: Esse aplicativo de amostra demonstra o modo registrado no Internet of Things Foundation. Essa amostra se conecta ao serviço registrado do Internet of Things Foundation. No modo registrado, os dispositivos podem publicar eventos e receber comandos.
zh_cn: 此样本应用程序演示 Internet of Things Foundation 中的已注册方式。此样本连接到 Internet of Things Foundation 已注册服务。在已注册方式中，设备可发布事件和接收命令。
zh_tw: 此範例應用程式示範 Internet of Things Foundation 中的已登錄模式。此範例可連接到 Internet of Things Foundation 已登錄服務。在已登錄模式中，裝置可同時發佈事件及接收指令。

source: But for running this sample, you must first register the device at https://internetofthings.ibmcloud.com/#/ and copy the credentials in the *device.cfg* file. Using this sample, users can publish events and receive commands from the Internet of Things Foundation service.
de: Sie müssen jedoch vor dem Ausführen dieses Beispiels zunächst die Einheit unter https://internetofthings.ibmcloud.com/#/ registrieren und die Identifikationsdaten in der Datei *device.cfg* kopieren. Mit diesem Beispiel können Benutzer Ereignisse publizieren und Befehle vom Internet of Things Foundation-Service empfangen.
es: Pero para ejecutar este ejemplo, primero debe registrar el dispositivo en https://internetofthings.ibmcloud.com/#/ y copiar las credenciales en el archivo *device.cfg*. Utilizando este ejemplo, los usuarios pueden publicar sucesos y recibir mandatos del servicio de Internet of Things Foundation.
fr: Toutefois, pour exécuter cet exemple, vous devez d'abord enregistrer le terminal à l'adresse https://internetofthings.ibmcloud.com/#/ et copier les données d'identification dans le fichier *device.cfg*. Cet exemple permet aux utilisateurs de publier des événements et de recevoir des commandes du service Internet of Things Foundation.
it: Per eseguire questo esempio, però, è necessario prima registrare il dispositivo all'indirizzo https://internetofthings.ibmcloud.com/#/ e copiare le credenziali nel file *device.cfg*. Utilizzando questo esempio, gli utenti possono pubblicare eventi e ricevere comandi dal servizio Internet of Things Foundation.
ja: しかし、このサンプルを実行するには、最初に https://internetofthings.ibmcloud.com/#/ でデバイスを登録し、*device.cfg* ファイルに資格情報をコピーする必要があります。このサンプルを使用すると、Internet of Things Foundation サービスからイベントをパブリッシュしたりコマンドを受信したりできます。
ko: 이 샘플을 실행하려면 먼저 https://internetofthings.ibmcloud.com/#/에서 디바이스를 등록한 후 *device.cfg* 파일에 있는 신임 정보를 복사해야 합니다. 이 샘플을 사용하면 사용자가 Internet of Things Foundation 서비스로부터 이벤트를 공개하고 명령을 수신할 수 있습니다.
pt_br: Mas para executar essa amostra, deve-se primeiro registrar o dispositivo em https://internetofthings.ibmcloud.com/#/ e copiar as credenciais no arquivo *device.cfg*. Usando essa amostra, os usuários podem publicar eventos e receber comandos do serviço Internet of Things Foundation.
zh_cn: 但是，要运行此样本，必须首先在 https://internetofthings.ibmcloud.com/#/ 处注册设备，并复制 *device.cfg* 文件中的凭证。使用此样本，用户可从 Internet of Things Foundation 服务发布事件和接收命令。
zh_tw: 但如果要執行此範例，您必須先在 https://internetofthings.ibmcloud.com/#/ 登錄裝置，並在 *device.cfg* 檔案中複製認證。使用此範例，使用者可從 Internet of Things Foundation 服務發佈事件及接收指令。
