Repository: HNorlen/iotf-rtd
Catalog: docs/libraries/programmingguides.po-*.po
Languages: fr, ko, pt_br

source: Programming Guides for the Internet of Things Foundation
fr: Guides de programmation d'Internet of Things Foundation
ko: Internet of Things Foundation의 프로그래밍 안내
pt_br: Guias de Programação para o Internet of Things Foundation

source: There are several client libraries availabe for use with the Internet of Things Foundation. These are designed to allow users to interact with their devices and applications using their preferred language, and to simplify this interaction as much as possible.
fr: Plusieurs bibliothèques client sont disponibles pour une utilisation avec Internet of Things Foundation. Elles sont conçues pour permettre aux utilisateurs d'interagir avec leurs terminaux et leurs applications en utilisant leur langage préféré et pour simplifier autant que possible cette interaction.
ko: Internet of Things Foundation과 함께 사용할 수 있는 여러 클라이언트 라이브러리가 있습니다. 이는 사용자로 하여금 선호하는 언어로 자신의 디바이스 및 애플리케이션과 상호작용할 수 있도록 해주고 이 상호작용을 최대한 단순화하도록 디자인되었습니다.
pt_br: Há várias bibliotecas do cliente disponíveis para uso com o Internet of Things Foundation. Elas são designadas para permitir que os usuários interajam com seus dispositivos e aplicativos usando seu idioma preferencial e para simplificar essa interação o máximo possível.

source: Current Programming Guides
fr: Guides de programmation actuels
ko: 현재 프로그래밍 안내
pt_br: Guias de Programação Atuais

source: `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__
fr: `Bibliothèque client Python - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__
ko: `Python 클라이언트 라이브러리 - 소개 <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__
pt_br: `Biblioteca do Cliente Python - Introdução <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__

source: `Python Client Library - Devices <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html#/>`__
fr: `Bibliothèque client Python - Terminaux <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html#/>`__
ko: `Python 클라이언트 라이브러리 - 디바이스 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html#/>`__
pt_br: `Biblioteca do Cliente Python - Dispositivos <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html#/>`__

source: `Python Client Library - Applications <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html#/>`__
fr: `Bibliothèque client Python - Applications <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html#/>`__
ko: `Python 클라이언트 라이브러리 - 애플리케이션 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html#/>`__
pt_br: `Biblioteca do Cliente Python - Aplicativos <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html#/>`__

source: Embedded C
ko: 임베디드 C
pt_br: C Integrado

source: `Embedded C Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/embeddedc/embedcintro.html#/>`__
fr: `Bibliothèque client Embedded C - Introduction <https://docs.internetofthings.ibmcloud.com/embeddedc/embedcintro.html#/>`__
ko: `임베디드 C 클라이언트 라이브러리 - 소개 <https://docs.internetofthings.ibmcloud.com/embeddedc/embedcintro.html#/>`__
pt_br: `Biblioteca do Cliente C Integrado - Introdução <https://docs.internetofthings.ibmcloud.com/embeddedc/embedcintro.html#/>`__

source: `Embedded C Client Library - Devices and Applications <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_devices.html#/>`__
fr: `Bibliothèque client Embedded C - Terminaux et applications <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_devices.html#/>`__
ko: `임베디드 C 클라이언트 라이브러리 - 디바이스 및 애플리케이션 <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_devices.html#/>`__
pt_br: `Biblioteca do Cliente C Integrado - Dispositivos e Aplicativos <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_devices.html#/>`__

source: `Embedded C Client Library - Samples <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_samples.html#/>`__
fr: `Bibliothèque client Embedded C - Exemples <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_samples.html#/>`__
ko: `임베디드 C 클라이언트 라이브러리 - 샘플 <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_samples.html#/>`__
pt_br: `Biblioteca do Cliente C Integrado - Amostras <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_samples.html#/>`__

source: `Java Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/java/javaintro.html#/>`__
fr: `Bibliothèque client Java - Introduction <https://docs.internetofthings.ibmcloud.com/java/javaintro.html#/>`__
ko: `Java 클라이언트 라이브러리 - 소개 <https://docs.internetofthings.ibmcloud.com/java/javaintro.html#/>`__
pt_br: `Biblioteca do Cliente Java - Introdução <https://docs.internetofthings.ibmcloud.com/java/javaintro.html#/>`__

source: `Java Client Library - Devices <https://docs.internetofthings.ibmcloud.com/java/java_cli_devices.html#/>`__
fr: `Bibliothèque client Java - Terminaux <https://docs.internetofthings.ibmcloud.com/java/java_cli_devices.html#/>`__
ko: `Java 클라이언트 라이브러리 - 디바이스 <https://docs.internetofthings.ibmcloud.com/java/java_cli_devices.html#/>`__
pt_br: `Biblioteca Cliente Java - Dispositivos <https://docs.internetofthings.ibmcloud.com/java/java_cli_devices.html#/>`__
