Repository: HNorlen/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/api/device_management.po
Languages: es, ja

source: The Device Management API
es: API de gestión de dispositivos
ja: デバイス管理 API

source: Authentication
es: Autenticación
ja: 認証

source: The API is only accessible over HTTPS and is protected by HTTP Basic Authentication, you must provide a username and password with every request.
es: La API solo es accesible a través de HTTPS y está protegida por la autenticación básica HTTP; debe proporcionar un nombre de usuario y una contraseña con cada solicitud.
ja: API は HTTPS を介してのみアクセス可能であり、HTTP 基本認証で保護されています。リクエストごとに、ユーザー名とパスワードを入力する必要があります。

source: Username
es: Nombre de usuario
ja: ユーザー名

source: A valid API key registered to the organization you want to work with.
es: Una clave de API válida registrada en la organización con la que desea trabajar.
ja: 作業する組織に対して登録された有効な API キー。

source: Password
es: Contraseña
ja: パスワード

source: The authentication token corresponding to your API key.
es: Señal de autenticación correspondiente a la clave de API.
ja: 使用する API キーに対応する認証トークン。

source: View Organization
es: Ver organización
ja: 組織を表示

source: Retrieve details about an organization.
es: Recuperar detalles sobre una organización.
ja: 組織に関する詳細を取得します。

source: Request
es: Solicitud
ja: リクエスト

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/

source: Request Body
es: Cuerpo de solicitud
ja: リクエストの Body

source: None
es: Ninguno
ja: なし

source: Response Body
es: Cuerpo de respuesta
ja: レスポンスの Body

source: id - String
es: id - Serie
ja: id - ストリング

source: name - String
es: name - Serie
ja: name - ストリング

source: created - ISO8601 date string
es: created - Serie de fecha ISO8601
ja: created - ISO8601 日付ストリング

source: updated - ISO8601 date string
es: updated - Serie de fecha ISO8601
ja: updated - ISO8601 日付ストリング

source: Example Response
es: Respuesta de ejemplo
ja: レスポンスの例

source: Common Response Codes
es: Códigos de respuesta comunes
ja: 一般的なレスポンス・コード

source: 200 (Success)
es: 200 (Éxito)
ja: 200 (成功)

source: List Devices
es: Listar dispositivos
ja: デバイスのリスト

source: Get a list of all devices in an organization.
es: Obtener una lista de todos los dispositivos de una organización.
ja: 組織内のすべてのデバイスのリストを取得します。

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/devices
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/devices

source: The response body will contain a list of devices, as below:
es: El cuerpo de respuesta contendrá una lista de dispositivos, como se indica más abajo:
ja: レスポンスの Body には、以下のようなデバイスのリストが含まれます。

source: uuid - String
es: uuid - Serie
ja: uuid - ストリング

source: type - String
es: type - Serie
ja: type - ストリング

source: metadata - Complex data (if available)
es: metadata - Datos complejos (si están disponibles)
ja: metadata - 複合データ (該当する場合)

source: date - ISO8601 date string
es: date - Serie de fecha ISO8601
ja: date - ISO8601 日付ストリング

source: clientAddress - String
es: clientAddress - Serie
ja: clientAddress - ストリング

source: protocol - String
es: protocol - Serie
ja: protocol - ストリング

source: action - String
es: action - Serie
ja: action - ストリング

source: timestamp - ISO8061 date string
es: timestamp - Serie de fecha ISO8061
ja: timestamp - ISO8061 日付ストリング

source: port - Integer
es: port - Entero
ja: port - 整数

source: List Devices by Type
es: Listar dispositivos por tipo
ja: デバイスをタイプ別にリスト

source: Get a list of all devices of a specific type in an organization.
es: Obtener una lista de todos los dispositivos de un tipo específico de una organización.
ja: 組織内の特定のタイプのすべてのデバイスのリストを取得します。

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/devices/**device\_type**
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/devices/**tipo\_dispositivo**

source: metadata - Complex data
es: metadata - Datos complejos
ja: metadata - 複合データ

source: List Device Types
es: Listar tipos de dispositivo
ja: デバイス・タイプのリスト

source: Get a list of all devices types in an organization.
es: Obtener una lista de todos los tipos de dispositivos de una organización.
ja: 組織内のすべてのデバイス・タイプのリストを取得します。

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/device-types
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/tipos-dispositivo

source: The response body will contain a list of device types:
es: El cuerpo de respuesta contendrá una lista de tipos de dispositivo:
ja: レスポンスの Body には、以下のようなデバイス・タイプのリストが含まれます。

source: deviceType - String
es: deviceType - Serie
ja: deviceType - ストリング

source: count - Integer
es: count - Entero
ja: count - 整数

source: Register a New Device
es: Registrar un dispositivo nuevo
ja: 新しいデバイスの登録

source: Register a new device to an organization.
es: Registrar un dispositivo nuevo en una organización.
ja: 組織に新しいデバイスを登録します。

source: You can use any scheme of your choice when assigning values for type and id to registered devices, however the following restrictions apply:
es: Puede utilizar cualquier esquema de su elección al asignar valores para type e id a los dispositivos registrados, sin embargo, se aplican las restricciones siguientes:
ja: 登録済みデバイスにタイプおよび ID の値を割り当てるときにはどのスキームを使用しても構いませんが、以下の制限が適用されます。

source: Maximum length of 32 characters
es: Longitud máxima de 32 caracteres
ja: 最大長 32 文字

source: Must comprise only alpha-numeric characters and the following special characters:
es: Debe constar solo de caracteres alfanuméricos y de los siguientes caracteres especiales:
ja: 英数字および以下の特殊文字でのみ構成する必要があります。

source: dash ("-")
es: guión ("-")
ja: ダッシュ ("-")

source: underscore ("\_")
es: subrayado ("\_")
ja: 下線 ("\_")

source: dot (".")
es: punto (".")
ja: ドット (".")

source: POST **org\_id**.internetofthings.ibmcloud.com/api/v0001/devices
es: POST **id\_org**.internetofthings.ibmcloud.com/api/v0001/devices

source: You must specify the type and identifer of the device being registered.
es: Debe especificar el tipo y el identificador del dispositivo que se está registrando.
ja: 登録中のデバイスのタイプと ID を指定する必要があります。

source: metadata - Complex data (optional)
es: metadata - Datos complejos (opcional)
ja: metadata - 複合データ (オプション)

source: password - String (optional, and follows the same restrictions as type and id, with a minimum length of 8 characters)
es: password - Serie (opcional y sigue las mismas restricciones que type e id, con una longitud mínima de 8 caracteres)
ja: password - ストリング (オプション。タイプや ID と同じ制限に従い、8 文字以上の長さが必要)

source: Example Request
es: Solicitud de ejemplo
ja: リクエストの例

source: Response Headers
es: Cabeceras de respuesta
ja: レスポンスのヘッダー

source: The response header will contain the location (resource URI) for the registered device. \* Location - URI
es: La cabecera de respuesta contendrá la ubicación (URI de recurso) para el dispositivo registrado. \* Ubicación - URI
ja: レスポンスのヘッダーには、登録済みデバイスのロケーション (リソース URI) が含まれます。\* Location - URI

source: The response body will contain a uuid and password for the registered device.
es: El cuerpo de respuesta contendrá un uuid y una contraseña para el dispositivo registrado.
ja: レスポンスの Body には、登録済みデバイスの uuid とパスワードが含まれます。

source: password - String
es: password - Serie
ja: password - ストリング

source: The response body will contain the generated authentication token for this device. You must make sure to record this token when processing the response. The data is stored hashed and salted so we are not able to retrieve lost authentication tokens.
es: El cuerpo de respuesta contendrá la señal de autenticación generada para este dispositivo. Debe asegurarse de registrar esta señal al procesar la respuesta. Los datos se almacenan con hash y salt, de modo que no podemos recupera señales de autenticación perdidas.
ja: レスポンスの Body にはこのデバイス用に生成された認証トークンが含まれます。レスポンスを処理するときには、必ずこのトークンを記録してください。データはハッシュ化およびソルト化して保存されるので、失われた認証トークンは取得できません。

source: 201 (Created) - The device was successfully registered (Location header set to the URL of the new device)
es: 201 (Creado) - El dispositivo se ha registrado correctamente (Cabecera de ubicación establecida en el URL del dispositivo nuevo)
ja: 201 (作成済み) - デバイスは正常に登録されました (ロケーション・ヘッダーが新しいデバイスの URL に設定されました)

source: Update a Registered Device
es: Actualizar un dispositivo registrado
ja: 登録済みデバイスの更新

source: Update an existing device in an organization.
es: Actualizar un dispositivo existente en una organización.
ja: 組織内の既存のデバイスを更新します。

source: PUT **org\_id**.internetofthings.ibmcloud.com/api/v0001/devices/**device\_type**/**device\_id**
es: PUT **id\_org**.internetofthings.ibmcloud.com/api/v0001/devices/**tipo\_dispositivo**/**id\_dispositivo**

source: Currently, the only property of a device that can be changed after initial registration is its metadata.
es: Actualmente, la única propiedad de un dispositivo que se puede cambiar después del registro inicial son sus metadatos.
ja: 現在、初回登録後に変更できるデバイスのプロパティーは、メタデータのみです。

source: The response body will contain the updated properties of the registered device.
es: El cuerpo de respuesta contendrá las propiedades actualizadas del dispositivo registrado.
ja: レスポンスの Body には、登録済みデバイスの更新されたプロパティーが含まれます。

source: View a Registered Device
es: Ver un dispositivo registrado
ja: 登録済みデバイスの表示

source: Get summary information about a registered device in an organization.
es: Obtener información de resumen sobre un dispositivo registrado en una organización.
ja: 組織内の登録済みデバイスに関する要約情報を取得します。

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/devices/**device\_type**/**device\_id**
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/devices/**tipo\_dispositivo**/**id\_dispositivo**

source: The response body will contain the known properties of the device.
es: El cuerpo de respuesta contendrá las propiedades conocidas del dispositivo.
ja: レスポンスの Body には、デバイスの既知のプロパティーが含まれます。

source: Delete a Registered Device
es: Suprimir un dispositivo registrado
ja: 登録済みデバイスの削除

source: Unregister a device from an organization.
es: Anular registro de un dispositivo de una organización.
ja: デバイスを組織から登録抹消します。

source: DELETE **org\_id**.internetofthings.ibmcloud.com/api/v0001/devices/**device\_type**/**device\_id**
es: DELETE **id\_org**.internetofthings.ibmcloud.com/api/v0001/devices/**tipo\_dispositivo**/**id\_dispositivo**

source: 204 (No Content) - The device was successfully deleted
es: 204 (Sin contenido) - El dispositivo se ha suprimido correctamente
ja: 204 (コンテンツなし) - デバイスは正常に削除されました
