Repository: HNorlen/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/programmingguides.po
Languages: de

source: Programming Guides for the Internet of Things Foundation
de: Programmierhandbücher für Internet of Things Foundation

source: There are several client libraries availabe for use with the Internet of Things Foundation. These are designed to allow users to interact with their devices and applications using their preferred language, and to simplify this interaction as much as possible.
de: Es sind mehrere Clientbibliotheken für die Verwendung mit Internet of Things Foundation verfügbar. Diese helfen Benutzer bei der Interaktion mit ihren Einheiten und Anwendungen unter Verwendung ihrer bevorzugten Sprache und vereinfachen daher diese Interaktion so weit wie möglich.

source: Current Programming Guides
de: Aktuelle Programmierhandbücher

source: `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__
de: `Python-Clientbibliothek - Einführung <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__

source: `Python Client Library - Devices <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html#/>`__
de: `Python-Clientbibliothek - Einheiten <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html#/>`__

source: `Python Client Library - Applications <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html#/>`__
de: `Python-Clientbibliothek - Anwendungen <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html#/>`__

source: `Embedded C Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/embeddedc/embedcintro.html#/>`__
de: `Embedded C-Clientbibliothek - Einführung <https://docs.internetofthings.ibmcloud.com/embeddedc/embedcintro.html#/>`__

source: `Embedded C Client Library - Devices and Applications <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_devices.html#/>`__
de: `Embedded C-Clientbibliothek - Einheiten und Anwendungen <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_devices.html#/>`__

source: `Embedded C Client Library - Samples <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_samples.html#/>`__
de: `Embedded C-Clientbibliothek - Beispiele <https://docs.internetofthings.ibmcloud.com/embeddedc/embeddedc_samples.html#/>`__

source: `Java Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/java/javaintro.html#/>`__
de: `Java-Clientbibliothek - Einführung<https://docs.internetofthings.ibmcloud.com/java/javaintro.html#/>`__

source: `Java Client Library - Devices <https://docs.internetofthings.ibmcloud.com/java/java_cli_devices.html#/>`__
de: `Java-Clientbibliothek - Einheiten <https://docs.internetofthings.ibmcloud.com/java/java_cli_devices.html#/>`__
