Repository: HNorlen/iotf-rtd
Catalog: docs/api/device_management.po-*.po
Languages: de, fr, ko

source: The Device Management API
de: API für das Einheitenmanagement
fr: API pour la gestion des terminaux
ko: 디바이스 관리 API

source: Authentication
de: Authentifizierung
fr: Authentification
ko: 인증

source: The API is only accessible over HTTPS and is protected by HTTP Basic Authentication, you must provide a username and password with every request.
de: Auf die API kann nur über HTTPS zugegriffen werden. Die API ist durch die HTTP-Basisauthentifizierung geschützt, und Sie müssen einen Benutzernamen und ein Kennwort bei jeder Anforderung eingeben.
fr: L'API est accessible uniquement sur HTTPS et est protégée par le mécanisme d'authentification de base HTTP. Vous devez indiquer un nom d'utilisateur et un mot de passe avec chaque demande.
ko: 이 API는 HTTPS를 통해서만 액세스할 수 있고 HTTP 기본 인증에 의해 보호되므로 사용자는 모든 요청과 함께 사용자 이름 및 비밀번호를 제공해야 합니다.

source: Username
de: Benutzername
fr: Nom d'utilisateur
ko: 사용자 이름

source: A valid API key registered to the organization you want to work with.
de: Ein gültiger API-Schlüssel, der in der Organisation, mit der Sie arbeiten wollen, registriert ist.
fr: Clé d'API valide enregistrée dans l'organisation que vous souhaitez utiliser.
ko: 작업할 조직에 등록된 올바른 API 키입니다.

source: Password
de: Kennwort
fr: Mot de passe
ko: 비밀번호

source: The authentication token corresponding to your API key.
de: Das Authentifizierungstoken, das Ihrem API-Schlüssel entspricht.
fr: Jeton d'authentification correspondant à votre clé d'API.
ko: API 키에 해당하는 인증 토큰입니다.

source: View Organization
de: Organisation anzeigen
fr: Affichage d'une organisation
ko: 조직 보기

source: Retrieve details about an organization.
de: Details zur Organisation abrufen.
fr: Extrayez les détails d'une organisation.
ko: 조직에 대한 세부사항을 검색합니다.

source: Request
de: Anforderung
fr: Demande
ko: 요청

source: Request Body
de: Anforderungs-Body
fr: Corps de la demande
ko: 요청 본문

source: None
de: Keiner
fr: Aucun
ko: 없음

source: Response Body
de: Antwort-Body
fr: Corps de la réponse
ko: 응답 본문

source: id - String
de: id - Zeichenfolge
fr: id - Chaîne
ko: id - 문자열

source: name - String
de: name - Zeichenfolge
fr: name - Chaîne
ko: 이름 - 문자열

source: created - ISO8601 date string
de: created - ISO8601-Datumszeichenfolge
fr: created - Chaîne de date ISO8601
ko: 작성됨 - ISO8601 날짜 문자열

source: updated - ISO8601 date string
de: updated - ISO8601-Datumszeichenfolge
fr: updated - Chaîne de date ISO8601
ko: 업데이트됨 - ISO8601 날짜 문자열

source: Example Response
de: Beispielantwort
fr: Exemple de réponse
ko: 예제 응답

source: Common Response Codes
de: Allgemeine Antwortcodes
fr: Codes de réponse courants
ko: 공통 응답 코드

source: 200 (Success)
de: 200 (Erfolg)
fr: 200 (Réussite)
ko: 200(성공)

source: List Devices
de: Einheiten auflisten
fr: Affichage de la liste de terminaux
ko: 디바이스 나열

source: Get a list of all devices in an organization.
de: Eine Liste aller Einheiten in einer Organisation abrufen.
fr: Affichez la liste de tous les terminaux d'une organisation.
ko: 조직의 모든 디바이스 목록을 가져옵니다.

source: The response body will contain a list of devices, as below:
de: Der Antwort-Body enthält eine Liste der Einheiten, wie folgt:
fr: Le corps de la réponse contiendra une liste de terminaux, comme indiqué ci-après :
ko: 응답 본문은 아래와 같이 디바이스 목록을 포함합니다.

source: uuid - String
de: uuid - Zeichenfolge
fr: uuid - Chaîne
ko: uuid - 문자열

source: type - String
de: type - Zeichenfolge
fr: type - Chaîne
ko: 유형 - 문자열

source: metadata - Complex data (if available)
de: metadata - Komplexe Daten (falls verfügbar)
fr: metadata - Données complexes (si disponibles)
ko: 메타데이터 - 복합 데이터(사용 가능한 경우)

source: registration
de: Registrierung
ko: 등록

source: auth
ko: 인증

source: date - ISO8601 date string
de: date - ISO8601-Datumszeichenfolge
fr: date - Chaîne de date ISO8601
ko: 날짜 - ISO8601 날짜 문자열

source: status
ko: 상태

source: clientAddress - String
de: clientAddress - Zeichenfolge
fr: clientAddress - Chaîne
ko: clientAddress - 문자열

source: protocol - String
de: protocol - Zeichenfolge
fr: protocol - Chaîne
ko: 프로토콜 - 문자열

source: action - String
de: action - Zeichenfolge
fr: action - Chaîne
ko: 조치 - 문자열

source: timestamp - ISO8061 date string
de: timestamp - ISO8601-Datumszeichenfolge
fr: timestamp - Chaîne de date ISO8601
ko: 시간소인 - ISO8061 날짜 문자열

source: port - Integer
de: port - Ganze Zahl
fr: port - Entier
ko: 포트 - 정수

source: List Devices by Type
de: Einheiten nach Typ auflisten
fr: Affichage de la liste des terminaux par type
ko: 유형별 디바이스 나열

source: Get a list of all devices of a specific type in an organization.
de: Eine Liste aller Einheiten eines bestimmten Typs in einer Organisation abrufen.
fr: Affichez la liste de tous les terminaux d'un type donné dans une organisation.
ko: 조직에 있는 특정 유형의 모든 디바이스 목록을 가져옵니다.

source: metadata - Complex data
de: metadata - Komplexe Daten
fr: metadata - Données complexes
ko: 메타데이터 - 복합 데이터

source: List Device Types
de: Einheitentypen auflisten
fr: Affichage de la liste des types de terminaux
ko: 디바이스 유형 나열

source: Get a list of all devices types in an organization.
de: Eine Liste aller Einheitentypen in einer Organisation abrufen.
fr: Affichez la liste de tous les types de terminaux d'une organisation.
ko: 조직의 모든 디바이스 유형 목록을 가져옵니다.

source: The response body will contain a list of device types:
de: Der Antwort-Body enthält eine Liste der Einheitentypen:
fr: Le corps de la réponse contiendra une liste de types de terminaux :
ko: 응답 본문은 디바이스 유형 목록을 포함합니다.

source: deviceType - String
de: deviceType - Zeichenfolge
fr: deviceType - Chaîne
ko: deviceType - 문자열

source: count - Integer
de: count - Ganze Zahl
fr: count - Entier
ko: 개수 - 정수

source: Register a New Device
de: Neue Einheit registrieren
fr: Enregistrement d'un nouveau terminal
ko: 새 디바이스 등록

source: Register a new device to an organization.
de: Eine neue Einheit für eine Organisation registrieren
fr: Enregistrez un nouveau terminal dans une organisation.
ko: 새 디바이스를 조직에 등록합니다.

source: You can use any scheme of your choice when assigning values for type and id to registered devices, however the following restrictions apply:
de: Sie können jedes Schema Ihrer Wahl verwenden, wenn Sie Werte für den Typ und die ID bei registrierten Einheiten zuordnen; es gelten jedoch die folgenden Einschränkungen:
fr: Vous pouvez utiliser les schémas de votre choix lorsque vous affectez des valeurs de type et d'ID aux terminaux enregistrés. Toutefois, les restrictions suivantes s'appliquent:
ko: 등록된 디바이스에 유형 및 id에 대한 값을 지정할 때 선택한 스킴을 사용할 수 있지만 다음과 같은 제한사항이 적용됩니다.

source: Maximum length of 32 characters
de: Maximale Länge von 32 Zeichen
fr: La valeur doit inclure 32 caractères maximum.
ko: 최대 길이 32자

source: Must comprise only alpha-numeric characters and the following special characters:
de: Darf nur alphanumerische Zeichen und die folgenden Sonderzeichen umfassen:
fr: La valeur doit inclure uniquement des caractères alphanumériques et les caractères spéciaux suivants :
ko: 영숫자 문자와 다음과 같은 특수 문자로만 구성되어야 함

source: dash ("-")
de: Gedankenstrich ("-")
fr: Tiret ("-")
ko: 대시("-")

source: underscore ("\_")
de: Unterstreichungszeichen ("\_")
fr: Trait de soulignement ("\_")
ko: 밑줄("\_")

source: dot (".")
de: Punkt (".")
fr: Point (".")
ko: 점(".")

source: You must specify the type and identifer of the device being registered.
de: Sie müssen den Typ und die Kennung der Einheit angeben, die registriert wird.
fr: Vous devez indiquer le type et l'identificateur du terminal en cours d'enregistrement.
ko: 등록 중인 디바이스의 ID 및 유형을 지정해야 합니다.

source: metadata - Complex data (optional)
de: metadata - Komplexe Daten (optional)
fr: metadata - Données complexes (facultatif)
ko: 메타데이터 - 복합 데이터(선택사항)

source: password - String (optional, and follows the same restrictions as type and id, with a minimum length of 8 characters)
de: password - Zeichenfolge (optional; folgt den gleichen Einschränkungen wie type und id mit einer Mindestlänge von 8 Zeichen)
fr: password - Chaîne (facultatif. Suit les mêmes restrictions que le type et l'ID avec une longueur minimale de 8 caractères)
ko: 비밀번호 - 문자열(선택사항이며 유형 및 id와 동일한 제한사항이 적용되고 최소 길이는 8자임)

source: Example Request
de: Beispielanforderung
fr: Exemple de demande
ko: 예제 요청

source: Response Headers
de: Antwortheader
fr: En-têtes de réponse
ko: 응답 헤더

source: The response header will contain the location (resource URI) for the registered device. \* Location - URI
de: der Antwortheader enthält die Position (Ressourcen-URI) für die registrierte Einheit. \* Location - URI
fr: L'en-tête de la réponse contiendra l'emplacement (URI de la ressource) du terminal enregistré. \* Location - URI
ko: 응답 헤더는 등록된 디바이스에 대한 위치(자원 URI)를 포함합니다. \* 위치 - URI

source: The response body will contain a uuid and password for the registered device.
de: Der Antwort-Body enthält eine uuidtg und ein Kennwort für die registrierte Einheit.
fr: Le corps de la réponse contiendra un UUID et un mot de passe pour le terminal enregistré.
ko: 응답 본문은 등록된 디바이스에 대한 uuid 및 비밀번호를 포함합니다.

source: password - String
de: password - Zeichenfolge
fr: password - Chaîne
ko: 비밀번호 - 문자열

source: The response body will contain the generated authentication token for this device. You must make sure to record this token when processing the response. The data is stored hashed and salted so we are not able to retrieve lost authentication tokens.
de: Der Antwort-Body enthält das generierte Authentifizierungstoken für diese Einheit. Notieren Sie sich unbedingt dieses Token, wenn Sie die Antwort verarbeiten. Die Daten werden hashverschlüsselt gespeichert und salted gespeichert; wir können also 'verlorene' Authentifizierungstoken nicht mehr abrufen.
fr: Le corps de la réponse contiendra le jeton d'authentification généré pour ce terminal. N'oubliez pas de noter ce jeton lors du traitement de la réponse. Les données étant stockées sous forme hachée et salée, les jetons d'authentification perdus ne pourront pas être récupérés.
ko: 응답 본문은 이 디바이스에 대해 생성된 인증 토큰을 포함합니다. 응답 처리 시 이 토큰을 기록해야 합니다. 데이터는 해시되고 솔트(salt)된 상태로 저장되므로 유실된 인증 토큰을 검색할 수 없습니다.

source: 201 (Created) - The device was successfully registered (Location header set to the URL of the new device)
de: 201 (Created) - Die Einheit wurde erfolgreich registriert (mit dem Positionsheader auf die URL der neuen Einheit gesetzt)
fr: 201 (Création) - Le terminal a été enregistré (en-tête Location incluant l'URL du nouveau terminal)
ko: 201(작성됨) - 디바이스가 등록되었음(위치 헤더가 새 디바이스의 URL로 설정됨)

source: Update a Registered Device
de: Registrierte Einheit aktualisieren
fr: Mise à jour d'un terminal enregistré
ko: 등록된 디바이스 업데이트

source: Update an existing device in an organization.
de: Vorhandene Einheit in einer Organisation aktualisieren.
fr: Mettez à jour un terminal existant dans une organisation.
ko: 조직의 기존 디바이스를 업데이트합니다.

source: Currently, the only property of a device that can be changed after initial registration is its metadata.
de: Die einzige Eigenschaft, die zur Zeit für eine Einheit nach der ursprünglichen Registrierung geändert werden kann, sind die Metadaten der Einheit.
fr: A l'heure actuelle, les métadonnées représentent la seule propriété d'un terminal que vous pouvez modifier après l'enregistrement initial.
ko: 현재 초기 등록 후 변경할 수 있는 유일한 디바이스 특성은 메타데이터입니다.

source: The response body will contain the updated properties of the registered device.
de: Der Antwort-Body enthält die aktualisierten Eigenschaften der registrierten Einheit.
fr: Le corps de la réponse contiendra les propriétés mises à jour du terminal enregistré.
ko: 응답 본문은 등록된 디바이스의 업데이트된 특성을 포함합니다.

source: View a Registered Device
de: Registrierte Einheit anzeigen
fr: Affichage d'un terminal enregistré
ko: 등록된 디바이스 보기

source: Get summary information about a registered device in an organization.
de: Übersichtsinformationen zu einer registrierten Einheit in einer Organisation abrufen.
fr: Affichez les informations récapitulatives d'un terminal enregistré dans une organisation.
ko: 조직의 등록된 디바이스에 대한 요약 정보를 가져옵니다.

source: The response body will contain the known properties of the device.
de: Der Antwort-Body enthält die bekannten Eigenschaften der Einheit.
fr: Le corps de la réponse contiendra les propriétés connues du terminal.
ko: 응답 본문은 디바이스의 알려진 특성을 포함합니다.

source: Delete a Registered Device
de: Registrierte Einheit löschen
fr: Suppression d'un terminal enregistré
ko: 등록된 디바이스 삭제

source: Unregister a device from an organization.
de: Registrierung einer Einheit in einer Organisation aufheben.
fr: Annulez l'enregistrement d'un terminal dans une organisation.
ko: 조직에서 디바이스를 등록 해제합니다.

source: 204 (No Content) - The device was successfully deleted
de: 204 (No Content) - Die Einheit wurde erfolgreich gelöscht
fr: 204 (Pas de contenu) - Le terminal a été supprimé
ko: 204(컨텐츠 없음) - 디바이스가 삭제되었음
